//! Обратные ковычки доп свойства
/*
 * В такую строку можно вставлять произвольные выражения,обернув их в ${...}:
 */

//*Пример
let textHi = "Hello!";
let textAll = `${textHi}Я строка!`;

console.log(textAll);

//*Пример
function someSum(a, b) {
  return a + b;
}
console.log(`Сумма: ${someSum(4, 7)}`);

//*Пример
//? Многострочная запись
let text = `Привет!
Вы на канале Фрилансер по жизни!
`;
console.log(text);

//? Всё что заключено в кавычки будет иметь тип данных String

//!----------------------------------------------------------------
/* 
! Спец-Символы.Все спецсимволы начинаються с обратного слеша
! так называемого "символа экранирования".
*/
//?--------------------------------------------
//?Перевод строки \n
let textTwo = "Привет!\nВы на канале,Фрилансер по жизни!";
console.log(textTwo);

//?--------------------------------------------
//? Табуляция (отступ) \t
let textThree = "\tПривет!\n\tВы на канале,Фрилансер по жизни!";
console.log(textThree);

//?--------------------------------------------
//? Один обратный слыеш это (\\)-2 обратных слеша :)

//?--------------------------------------------
//? Кавычки \' \"
let textFoo = '\t\t\tПривет!\nВы на канале,"Фрилансер по жизни!"';
console.log(textFoo);

//?--------------------------------------------
//? Иконки, символы UTF-16 \ukod, UTF-32 \u{КОД}
let textFive = "Живи,а работай в свободное время!\u{1f60e}\u{1f60e}\u{1f60e}";
console.log(textFive);

//!----------------------------------------------------------------
//!Длина строки.Свойство Length
let textSix = "Привет!";
console.log(textSix.length);
//?--------------------------------------------
//?Получаем символы строки
let text1 = "Привет!";
let firstSymbol = text1[0];
let lasttSymbol = text1[text1.length - 1];
console.log(firstSymbol);
console.log(lasttSymbol);

for (const char of text1) {
  console.log(char);
}//?--------------------------------------------
//?Изменение регистра
let text2 = "Привет!";
console.log(text2.toUpperCase());
console.log(text2.toLowerCase());

//!----------------------------------------------------------------
//! Поиск подстроки

//?--------------------------------------------
//? 1-Метод
let text3 = "Привет!";
console.log(text3.indexOf("рив"));
console.log(text3.indexOf("рив", 3));

//?--------------------------------------------
//? 2-Методы incLudes, startsWith, endsWith
/*
 * str.includes(substr,pos) возвращает true или false
 */

let text4 = "Привет!";
console.log(text4.includes("ив"));
console.log(text4.includes("ив", 3));

console.log(text4.startsWith("ив"));
console.log(text4.endsWith("!"));

//?--------------------------------------------
//? Получение части строки (подстроки) от и до (не включая)
let text5 = "Привет!";
console.log(text5.slice(1, 2));// Отчёт с начала
console.log(text5.slice(-2, -1));// Отчёт с конца
console.log(text5.slice(1));

